app/Controllers/Front/Informasi.php

SELECT *
FROM `berita`
WHERE `status_publish` = 'publish'
AND `tgl_publish` <= '2026-03-06 00:40:59'
ORDER BY `tgl_publish` DESC
---
    public function berita_list()
    {
        $beritaModel = new BeritaModel();
        $data = array_merge($this->globalData, [
            'title'  => 'Berita Sekolah',
            'berita' => $beritaModel->where('status_publish', 'publish')
                                    ->where('tgl_publish <=', date('Y-m-d H:i:s'))
                                    ->orderBy('tgl_publish', 'DESC')
                                    ->findAll()