app/Controllers/Front/Profil.php

SELECT *
FROM `kategori_fasilitas`
---
    public function fasilitas_list()
    {
        $fasilitasModel = new FasilitasModel();
        $kategoriModel = new KategoriFasilitasModel();
        $data = array_merge($this->globalData, [
            'title'     => 'Fasilitas Sekolah',
            'kategori'  => $kategoriModel->findAll(),