app/Controllers/Admin/Pengaturan.php

SELECT *
FROM `pengaturan`
 LIMIT 1
---
    public function warna_bg()
    {
        $data = [
            'title'      => 'Pengaturan Warna Background',
            'pengaturan' => $this->pengaturanModel->first()

UPDATE `pengaturan` SET `warna_bg` = '#ffffff', `warna_header` = '#e3e3e3'
WHERE `pengaturan`.`id` IN ('1')
---
    public function update_warna()
    {
        $id = $this->request->getPost('id');
        $this->pengaturanModel->update($id, [
            'warna_bg' => $this->request->getPost('warna_bg')
        ]);