app/Controllers/Admin/UserAdmin.php

SELECT *
FROM `users`
WHERE `role` = 'admin'
---
    public function index()
    {
        $data = [
            'title' => 'Data Admin',
            'admin' => $this->usersModel->where('role', 'admin')->findAll()

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function edit($id)
    {
        $data = [
            'title' => 'Edit User Admin',
            'admin' => $this->usersModel->find($id)