app/Views/layout/backend_layout.php

<?php $dbProfil = (new \App\Models\ProfilSekolahModel())->first(); ?>
---
SELECT *
FROM `profil_sekolah`
 LIMIT 1