app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        $session = \Config\Services::session();

        $profilModel = new \App\Models\ProfilSekolahModel();
        $pengaturanModel = new \App\Models\PengaturanModel();
        $menuEksternalModel = new \App\Models\MenuEksternalModel();

        $this->globalData = [
            'profil' => $profilModel->first(),
            'pengaturan' => $pengaturanModel->first(),
            'menu_eksternal' => $menuEksternalModel->findAll()
        ];
---
SELECT *
FROM `profil_sekolah`
 LIMIT 1
SELECT *
FROM `pengaturan`
 LIMIT 1
SELECT *
FROM `menu_eksternal`