app/Controllers/Home.php

    public function index()
    {
        $slideModel = new SlideShowModel();
        $prestasiModel = new PrestasiModel();
        $programModel = new ProgramModel();

        $data = array_merge($this->globalData, [
            'title'    => 'Beranda',
            'slides'   => $slideModel->findAll(),
            'prestasi' => $prestasiModel->select('prestasi.*, kategori_prestasi.nama_kategori')
                                        ->join('kategori_prestasi', 'kategori_prestasi.id = prestasi.kategori_id')
                                        ->orderBy('tgl_penerimaan', 'DESC')
                                        ->findAll(6),
            'program'  => $programModel->select('program_unggulan.*, kategori_program.nama_kategori')
                                        ->join('kategori_program', 'kategori_program.id = program_unggulan.kategori_id')
                                        ->orderBy('program_unggulan.id', 'DESC')
                                        ->findAll(6)
---
SELECT *
FROM `slide_show`
SELECT `prestasi`.*, `kategori_prestasi`.`nama_kategori`
FROM `prestasi`
JOIN `kategori_prestasi` ON `kategori_prestasi`.`id` = `prestasi`.`kategori_id`
ORDER BY `tgl_penerimaan` DESC
 LIMIT 6
SELECT `program_unggulan`.*, `kategori_program`.`nama_kategori`
FROM `program_unggulan`
JOIN `kategori_program` ON `kategori_program`.`id` = `program_unggulan`.`kategori_id`
ORDER BY `program_unggulan`.`id` DESC
 LIMIT 6