app/Controllers/Home.php

SELECT *
FROM `prestasi`
ORDER BY `tgl_penerimaan` DESC
 LIMIT 6
---
    public function index()
    {
        $slideModel = new SlideShowModel();
        $prestasiModel = new PrestasiModel();
        $programModel = new ProgramModel();

        $data = array_merge($this->globalData, [
            'title'    => 'Beranda',
            'slides'   => $slideModel->findAll(),
            'prestasi' => $prestasiModel->orderBy('tgl_penerimaan', 'DESC')->findAll(6),