app/Models/EskulModel.php

SELECT `ekstrakurikuler`.*, `kategori_ekstrakurikuler`.`nama_kategori`
FROM `ekstrakurikuler`
JOIN `kategori_ekstrakurikuler` ON `kategori_ekstrakurikuler`.`id` = `ekstrakurikuler`.`kategori_id`
ORDER BY `ekstrakurikuler`.`id` DESC
---
    public function getEskulWithKategori()
    {
        return $this->select('ekstrakurikuler.*, kategori_ekstrakurikuler.nama_kategori')
                    ->join('kategori_ekstrakurikuler', 'kategori_ekstrakurikuler.id = ekstrakurikuler.kategori_id')
                    ->orderBy('ekstrakurikuler.id', 'DESC')
                    ->findAll();