app/Models/FasilitasModel.php

SELECT `fasilitas`.*, `kategori_fasilitas`.`nama_kategori`
FROM `fasilitas`
JOIN `kategori_fasilitas` ON `kategori_fasilitas`.`id` = `fasilitas`.`kategori_id`
ORDER BY `fasilitas`.`id` DESC
---
    public function getFasilitasWithKategori()
    {
        return $this->select('fasilitas.*, kategori_fasilitas.nama_kategori')
                    ->join('kategori_fasilitas', 'kategori_fasilitas.id = fasilitas.kategori_id')
                    ->orderBy('fasilitas.id', 'DESC')
                    ->findAll();