app/Models/PengumumanModel.php

SELECT `pengumuman`.*, `kategori_pengumuman`.`nama_kategori`, `users`.`nama_lengkap` as `nama_penulis`
FROM `pengumuman`
JOIN `kategori_pengumuman` ON `kategori_pengumuman`.`id` = `pengumuman`.`kategori_id`
JOIN `users` ON `users`.`id` = `pengumuman`.`penulis_id`
ORDER BY `pengumuman`.`tgl_publish` DESC
---
    public function getPengumumanLengkap()
    {
        return $this->select('pengumuman.*, kategori_pengumuman.nama_kategori, users.nama_lengkap as nama_penulis')
                    ->join('kategori_pengumuman', 'kategori_pengumuman.id = pengumuman.kategori_id')
                    ->join('users', 'users.id = pengumuman.penulis_id')
                    ->orderBy('pengumuman.tgl_publish', 'DESC')
                    ->findAll();