app/Models/ProgramModel.php

    public function getProgramWithKategori()
    {
        return $this->select('program_unggulan.*, kategori_program.nama_kategori')
                    ->join('kategori_program', 'kategori_program.id = program_unggulan.kategori_id')
                    ->orderBy('program_unggulan.id', 'DESC')
                    ->findAll();
---
SELECT `program_unggulan`.*, `kategori_program`.`nama_kategori`
FROM `program_unggulan`
JOIN `kategori_program` ON `kategori_program`.`id` = `program_unggulan`.`kategori_id`
ORDER BY `program_unggulan`.`id` DESC